Update: Improve docs
